package Diplom.Smart.Dubinin.SmartCRUD.Controller;

public enum Tables {
    Пользователи_эдо(new String[]{"id_пользователя_эдо", "Имя ЭДО", "Имя пользователя", "Токен пользователя", "false", "false"}),
    Классы_Логирования(new String[]{"id_класса", "Класс логирования", "false", "false"}),
    Роли(new String[]{"id_роли", "Роль", "false", "false"}),
    Смарт_контракты(new String[]{"id_контракта", "Название ЭДО", "Имя первой компании", "Имя второй компании", "Название контракта", "Статус", "false", "false"}),
    Статусы_Смарт_Контрактов(new String[]{"id_статуса", "Статус", "false", "false"}),
    Пользователи(new String[]{"id_пользователя", "Имя", "Роль", "Логин", "Пароль", "true", "true"}),
    Документация(new String[]{"id_документа", "Название документа", "true", "true"}),
    Логи(new String[]{"id_логирования", "Класс логирования", "Текст логирования", "Время логирования", "Имя пользователя", "false", "false"}),
    Отчеты(new String[]{"id_отчета", "Имя пользователя", "Название отчета", "true", "false"}),
    Шаблоны_Смарт_контрактов(new String[]{"id_шаблона", "Название шаблона", "false", "false"}),
    ;


    public String[] tables;

    Tables(String[] strings) {
        this.tables = strings;
    }
}
